CSI API ETABS v1
cDesignCompositeColumn.GetTargetPeriod Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTargetPeriod(
	ref int NumberItems,
	ref string ModalCase,
	ref int[] Mode,
	ref double[] Period,
	ref bool Active
)
Function GetTargetPeriod (
	ByRef NumberItems As Integer,
	ByRef ModalCase As String,
	ByRef Mode As Integer(),
	ByRef Period As Double(),
	ByRef Active As Boolean
) As Integer
Dim instance As cDesignCompositeColumn
Dim NumberItems As Integer
Dim ModalCase As String
Dim Mode As Integer()
Dim Period As Double()
Dim Active As Boolean
Dim returnValue As Integer
returnValue = instance.GetTargetPeriod(NumberItems,
	ModalCase, Mode, Period, Active)
int GetTargetPeriod(
	int% NumberItems,
	String^% ModalCase,
	array<int>^% Mode,
	array<double>^% Period,
	bool% Active
)
abstract GetTargetPeriod :
        NumberItems : int byref *
        ModalCase : string byref *
        Mode : int[] byref *
        Period : float[] byref *
        Active : bool byref -> int
Parameters
NumberItems
Type: System.Int32
ModalCase
Type: System.String
Mode
Type: System.Int32[]
Period
Type: System.Double[]
Active
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cDesignCompositeColumn Interface
ETABSv1 Namespace